{"/about/":{"data":{"":"","current-status#Current Status":"Chapar is currently in the early beta phase and under active development, with regular updates and improvements planned to enhance the user experience and functionality.","features#Features":"Create and manage workspaces to organize your API endpoints. Create and manage environments to store variables and configurations for your API endpoints. Create and manage requests to test your API endpoints. Send requests with different methods (GET, POST, PUT, DELETE, PATCH, HEAD, OPTION,CONNECT). Send requests with different content types (JSON, XML, Form, Text, HTML). Send requests with different authentication methods (Basic, Bearer, API Key, No Auth). Send requests with different body types (Form, Raw, Binary). Set environment variables from the response of the request using JSONPath. Dark mode support. Data is stored locally on your machine. and no data is sent to any server. Import collections and requests from Postman. Support GRPC protocol. Support for grpc reflection and proto files. Load sample request structure of given grpc method. Chaining requests with Pre/Post request option.","how-is-chapar-implemented#How is Chapar implemented?":"Single binary API testing tool writen in Go using the Gio framework.","how-to-stay-in-touch#How to stay in touch?":"Star the repo at github.com/chapar-rest/chapar Email at support@chapar.rest Follow on X Connect on Slack Subscribe to YouTube channel Chapar","project-goals#Project Goals":"The goal of this project is to make it easy for individuals and teams to test their APIs with ease. Chapar aims to offer a user-friendly experience with support for both HTTP and gRPC protocols with a focus on ease of use and speed of development.","what-chapar-means#What Chapar means?":"Chapar was the institution of the royal mounted couriers in ancient Persia. The messengers, called Chapar, alternated in stations a day’s ride apart along the Royal Road. The riders were exclusively in the service of the Great King and the network allowed for messages to be transported from Susa to Sardis (2699 km) in nine days; the journey took ninety days on foot.\nHerodus described the Chapar as follows:\nThere is nothing in the world that travels faster than these Persian couriers. Neither snow, nor rain, nor heat, nor darkness of night prevents these couriers from completing their designated stages with utmost speed.\nHerodotus, about 440 BC","what-is-chapar#What is Chapar?":"Chapar is an upcoming native API testing tool built with Go, designed to simplify and expedite the testing process for developers. While still in its early beta phase, Chapar aims to offer a user-friendly experience with support for both HTTP and gRPC protocols with.","who-is-behind-this-project#Who is behind this project?":"The project was started by Mohsen Mirzakhani. Mohsen’s background has been in software development and architecture. Chapar was started to find ways to simplify and expedite the testing process for developers."},"title":"About"},"/docs/":{"data":{"":"Chapar is an upcoming native API testing tool built with Go, designed to simplify and expedite the testing process for developers. While still in its early beta phase, Chapar aims to offer a user-friendly experience with support for both HTTP and gRPC protocols with.\nGetting StartedGetting started with Chapar Using ChaparLearn how to use Chapar to test your APIs TermsTerms and conditions of using Chapar"},"title":"Docs"},"/docs/gettingstarted/":{"data":{"":"Chapar is an upcoming native API testing tool built with Go, designed to simplify and expedite the testing process for developers. While still in its early beta phase, Chapar aims to offer a user-friendly experience with support for both HTTP and gRPC protocols with.\nInstallationHow to install Chapar and do initial setup Import And Export DataHow to import and export data into Chapar"},"title":"Getting Started"},"/docs/gettingstarted/import-and-export-data/":{"data":{"":"All your data is stored locally on your machine. so you can import data from a file or a directory. Where the default location is, is dependent on the operating system. you can change the default location in the settings.\nmacoswindowslinux macos: The default location for macOS is ~/.config/.chapar. windows: The default location for Windows is %APPDATA%\\chapar. linux: The default location for Linux is ~/.config/chapar.","change-data-location#Change Data Location":"You can change the default location for the data in the settings.\nNavigate to the settings and select the data location. there you can see where the data is stored. and you can change it to a different location. After changing the data location, you need to restart the app for the changes to take effect.\nIn the current version of Chapar, everything is stored in as files even the environment variables. which means if you put sensitive information in the environment variables, it will be stored in the file system. This will be improved in the future. but for now, you need to be careful sharing your data with others.","import#Import":"Chapar supports importing data from number of different formats.\nOpen API Specification (OAS) Protobuf files Postman Collection Postman Requests Postman Environments Insomnia (Planned) Har (Planned) To import requests use the import button in the top right corner. and select the file you want to import.","tip-use-a-version-control-system#Tip: Use a version control system":"It’s a good idea to use a version control system to keep track of your changes. you can use git to do this.\ngit init git add . git commit -m \"Initial commit\" You can then push your changes to a remote repository. and share it with your team."},"title":"Import And Export Data"},"/docs/gettingstarted/installation/":{"data":{"":"","install-from-source#Install from source.":"Chapar is written in Go, so you can install it from source by cloning the repository and running go build.\ngit clone https://github.com/chapar-rest/chapar.git cd chapar go build -o chapar . The GUI framework used is Gio. and its using the CGO to compile the binary. which is why you need to have the C compiler installed. more details here.","install-release-build#Install Release Build":"Chapar is available as a release build for macOS, Windows, and Linux. You can download the latest release from the Chapar GitHub Releases page.","macos#macOS":"On macos you can install Chapar from the App Store.","on-arch-linux#On Arch Linux":"On Arch Linux you can install Chapar from the AUR. this package is built by the community and is not officially supported by the Chapar team."},"title":"Installation"},"/docs/terms/":{"data":{"":"Learn the terms and conditions of using Chapar.\nLicenseLicense of Chapar Privacy PolicyPrivacy policy of Chapar Code of ConductCode of conduct of Chapar Financial ContributionsFinancial contributions to Chapar How to ContributeHow to contribute to Chapar"},"title":"Terms"},"/docs/terms/code-of-conduct/":{"data":{"":"We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, caste, color, religion, or sexual identity and orientation.\nWe pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.","1-correction#1. Correction":"Community Impact: Use of inappropriate language or other behaviour deemed unprofessional or unwelcome in the community.\nConsequence: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behaviour was inappropriate. A public apology may be requested.","2-warning#2. Warning":"Community Impact: A violation through a single incident or series of actions.\nConsequence: A warning with consequences for continued behaviour. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.","3-temporary-ban#3. Temporary Ban":"Community Impact: A serious violation of community standards, including sustained inappropriate behaviour.\nConsequence: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.","4-permanent-ban#4. Permanent Ban":"Community Impact: Demonstrating a pattern of violation of community standards, including sustained inappropriate behaviour, harassment of an individual, or aggression toward or disparagement of classes of individuals.\nConsequence: A permanent ban from any sort of public interaction within the community.","attribution#Attribution":"This Code of Conduct is adapted from the Contributor Covenant, version 2.1, available at https://www.contributor-covenant.org/version/2/1/code_of_conduct.html.\nCommunity Impact Guidelines were inspired by Mozilla’s code of conduct enforcement ladder.\nFor answers to common questions about this code of conduct, see the FAQ at https://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations.","enforcement#Enforcement":"Instances of abusive, harassing, or otherwise unacceptable behaviour may be reported by contacting the project team at help@chapar.rest. All complaints will be reviewed and investigated promptly and fairly.\nAll community leaders are obligated to respect the privacy and security of the reporter of any incident.","enforcement-guidelines#Enforcement Guidelines":"Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:","enforcement-responsibilities#Enforcement Responsibilities":"Community leaders are responsible for clarifying and enforcing our standards of acceptable behaviour and will take appropriate and fair corrective action in response to any behaviour that they deem inappropriate, threatening, offensive, or harmful.\nCommunity leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate.","our-standards#Our Standards":"Examples of behaviour that contributes to a positive environment for our community include:\nDemonstrating empathy and kindness toward other people Being respectful of differing opinions, viewpoints, and experiences Giving and gracefully accepting constructive feedback Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience Focusing on what is best not just for us as individuals, but for the overall community Examples of unacceptable behaviour include:\nThe use of sexualized language or imagery, and sexual attention or advances of any kind Trolling, insulting or derogatory comments, and personal or political attacks Public or private harassment Publishing others’ private information, such as a physical or email address, without their explicit permission Other conduct which could reasonably be considered inappropriate in a professional setting","scope#Scope":"This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event."},"title":"Code of Conduct"},"/docs/terms/financial-contributions/":{"data":{"":"Chapar is an open-source project that relies on the support of the community to continue development. If you find Chapar useful and would like to help support the project, you can make a financial contribution. Financial contributions help cover the costs of hosting, development, and maintenance of the project.","buy-us-a-coffee#Buy us a coffee":"If you find Chapar useful and would like to show your appreciation, you can buy us a coffee. Your contribution helps keep the team motivated and energized to continue working on the project.","how-to-contribute-financially#How to contribute financially":"Regardless of the amount, your financial contribution is greatly appreciated and helps ensure the continued development of Chapar. You can buy us a coffee, sponsor the project, or make a one-time donation. Here are some ways you can contribute financially:"},"title":"Financial Contributions"},"/docs/terms/how-to-contribute/":{"data":{"":"Contribute to code Contributing to the codebase is a great way to help improve the project. Here’s how you can get started:","contribute-financially#Contribute financially":"Help support the team developing Chapar by becoming a financial contributor.","contribute-to-code#Contribute to code":"","create-a-pull-request#Create a Pull Request":"Fork the repository: Click the “Fork” button in the top right corner of the repository page to create your own copy of the repo. Clone the repository: Clone your forked repository to your local machine using git clone . Create a new branch: Create a new branch for your changes with a descriptive name, such as feature/add-new-feature or fix/bug-description. git checkout -b feature/your-feature-name Make your changes: Implement your changes or new features. Make sure your code adheres to the project’s coding standards and guidelines. Commit your changes: Use the Conventional Commits Specification for your commit messages. git commit -m \"feat: description of your feature\" Push your changes: Push your changes to your forked repository. git push origin feature/your-feature-name Create a Pull Request: Go to the original repository and create a new pull request. Make sure to provide a detailed description of your changes. Follow the GitHub flow. Follow the Conventional Commits Specification","help-others#Help others":"Participating in the community and helping others is a valuable way to contribute. Here’s how you can get involved:\nAnswer questions: Visit the Chapar Issues page to find questions and issues raised by other users. Provide helpful answers and solutions.\nShare knowledge: Write tutorials, blog posts, or create videos explaining how to use different features of the project.\nReport bugs: If you encounter any bugs, report them by creating a new issue on the Chapar Issues page. Provide detailed information to help the maintainers understand and reproduce the issue. is the place to get help and help others with Chapar.","improve-documentation#Improve documentation":"Good documentation is essential for any project. Here’s how you can contribute to the documentation:\nIdentify areas for improvement: Look for typos, unclear sections, or outdated information in the existing documentation. Edit the documentation: Make the necessary changes in the documentation files. These are usually found in the docs folder or as README.md files in various directories. Follow the same process: Use the same GitHub flow and Conventional Commits Specification as you would for code contributions. Submit a Pull Request: Provide a clear explanation of the documentation improvements you made."},"title":"How to Contribute"},"/docs/terms/licence/":{"data":{"":"Chapar is open-source software published under BSD-3-Clause license.\nYou can find the licence in the LICENSE file.","chapar-promises#Chapar promises":"Chapar started as a personal project to help me test my APIs. its open source and free to use and will remain free to use and open source."},"title":"Licence"},"/docs/terms/privacy-policy/":{"data":{"":"Last Updated: 30 March 2025","changes-to-this-privacy-policy#Changes to This Privacy Policy":"We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the “Last Updated” date.","childrens-privacy#Children\u0026rsquo;s Privacy":"Our application does not collect information from anyone, including children under the age of 13.","contact-us#Contact Us":"If you have any questions about this Privacy Policy, please contact us at:\nEmail: [support@chapar.rest]","data-storage#Data Storage":"All data created or used by Chapar is stored locally on your device only. We have no ability to access this data.","information-collection#Information Collection":"We do not collect any personal information. Chapar operates entirely on your device and does not:\nCollect personal data Track your usage Send any data to remote servers Use analytics services Use advertising frameworks Create user profiles","introduction#Introduction":"This Privacy Policy describes how Chapar (“we”, “our”, or “us”) handles privacy matters. Chapar is a free, open-source application that respects your privacy by design.","open-source#Open Source":"Chapar is open-source software. You can review our code at: https://github.com/chapar-rest/chapar","third-party-services#Third-Party Services":"Chapar does not integrate with or utilize any third-party services that would collect your information."},"title":"Privacy Policy"},"/docs/usingchapar/":{"data":{"":"Learn how to use Chapar to test your APIs.\nWorkspacesHow to create and manage workspaces EnvironmentsHow to create and manage environments Requests and CollectionsHow to create and manage requests and collections"},"title":"Using Chapar"},"/docs/usingchapar/environments/":{"data":{"":"Use environments to manage your API keys, base URLs, and other API-specific settings. To manage environments, you can click on the environments button on the left navigation bar.","create-a-new-environment#Create a new environment":"Click on the new button to create a new environment.\nA new environment will be created with New Environment as the name. you can click on the name to edit the name of the environment and press enter to save the changes.","edit-an-environment#Edit an environment":"You can edit an environment by clicking on the environment in the left sidebar. environment will be opened as a tab in the main window. you can close the tab by clicking the close button on the tab.\nUsing the plus button (2) you can add a new variable to the environment. variables are used to store the API keys, base URLs, and other API-specific settings. You can delete a variable by clicking on the delete button on each row.","switch-between-environments#Switch between environments":"You can switch between environments by choosing the environment from the environments dropdown menu in the top right corner.","using-variables-in-requests#Using variables in requests":"After selecting the environment, anywere in your request you can use its variables by using the {{ variable_name }} syntax."},"title":"Environments"},"/docs/usingchapar/functions/":{"data":{"":"Chapar comes with a built-in functions to generate random data, validate data, and more.","list-of-functions#List of functions:":"{{randomUUID4}} - Generates a random UUID version 4. {{timeNow}} - Generates the current time in RFC3339 format. {{unixTimestamp}} - Generates the current Unix timestamp. {{randInt1000}} - Generates a random integer between 0 and 1000. {{randInt100}} - Generates a random integer between 0 and 100. {{randInt}} - Generates a random integer between 0 and maxInt. {{randFloat}} - Generates a random 64 float {{randFloat32}} - Generates a random 32 float {{fullDate}} - Generates the current date in the format “2006-01-02”. {{randBool}} - Generates a random boolean value."},"title":"Functions"},"/docs/usingchapar/requests-and-collections/":{"data":{"":"","create-a-new-request-or-collection#Create a new request or collection":"You can create a new request or collection by clicking the new button in the top right corner. and selecting the type of request or collection you want to create.\nA new collection will be created with New Collection as the name. and a new request will be created with New Request as the name. you can click on the name to edit the name of the request or collection and press enter to save the changes.\nTo add a request to a collection, you can click on the three dots on the collection and select the request you want to add.\nFrom the same menu you can also delete the request or collection.","open-a-request#Open a request":"You can open a request by clicking on the request in the left sidebar.request will be opened as a tab in the main window. you can close the tab by clicking the close button on the tab."},"title":"Requests and Collections"},"/docs/usingchapar/workspaces/":{"data":{"":"Workspaces are a way to organize your requests and collections. To manage workspaces, you can click on the workspaces button on the left navigation bar.","create-a-new-workspace#Create a new workspace":"You can create a new workspace by clicking the new button in the top right corner.","switch-between-workspaces#Switch between workspaces":"You can switch between workspaces by choosing the workspace from the workspaces dropdown menu in the top left.\nWhen you switch between workspaces, make sure you save and close all the requests and collections that you are working on. otherwise you will might lose your work."},"title":"Workspaces"}}